{
    "id": "triathlete_lower_body_imbalance_prevention_strict_schema_v1",
    "metadata": {
      "discipline": "triathlon",
      "target_group": "Triatlonista z dysbalansami (skolioza L/Th, niestabilność L st. skokowego, osłabienie L KKD po urazie, słaby brzuch, średnia siła pośladków)",
      "target_goal": "injury_prevention",
      "level_hint": "Doświadczony (z uwzględnieniem dysbalansów)",
      "days_per_week": "Codziennie (rutyna korekcyjna)",
      "duration_weeks": "Ciągły / Nieokreślony",
      "description": "Codzienna rutyna (rolowanie, rozciąganie, aktywacja) dla triatlonisty z zidentyfikowanymi asymetriami i osłabieniami (skolioza, L strona KKD, core). Celem jest prewencja kontuzji biegowych poprzez wzmocnienie słabych ogniw, poprawę stabilności, mobilności i kontroli nerwowo-mięśniowej. Do stosowania jako uzupełnienie treningu.",
      "author": "Generator Fizjo AI (na podstawie zaleceń)"
    },
    "plan_weeks": [
      {
        "week_num": 1,
        "focus": "Codzienna rutyna korekcyjna: Rolowanie + Rozciąganie + Aktywacja. Cel: prewencja kontuzji, wzmocnienie, stabilizacja, mobilność.",
        "days": [
          {"day_name": "Codziennie", "workout": "Wykonaj zestaw ćwiczeń korekcyjnych (patrz sekcja 'Ćwiczenia'). Minimum 1x dziennie."},
          {"day_name": "Serie", "workout": "Wykonaj 1-3 serie ćwiczeń rozciągających i aktywacyjnych."},
          {"day_name": "Dodatkowo", "workout": "Kontynuuj poprzednie ćwiczenia. Min. 10 tys. kroków/dzień lub inny ruch symetryczny (pływanie)."},
          {"day_name": "Praca biurowa", "workout": "Pamiętaj o aktywnych przerwach (wstawaj, chodź, rotuj kręgosłup, napinaj brzuch, rozciągaj przód ud)."},
          {"day_name": "-", "workout": "-"},
          {"day_name": "-", "workout": "-"},
          {"day_name": "-", "workout": "-"}
        ]
      }
    ],
    "corrective_exercises": {
      "frequency": "Codziennie minimum 1x. Wykonaj 1-3 serie ćwiczeń rozciągających i aktywacyjnych.",
      "list": [
        {
          "name": "[Rolowanie] Przód uda",
          "description": "Roluj powoli mięsień czworogłowy uda od biodra do kolana.",
          "sets_reps": "Ok. 1-2 minuty na każdą nogę."
        },
        {
          "name": "[Rolowanie] Naprężacz powięzi szerokiej (TFL)",
          "description": "Roluj obszar z boku biodra, poniżej kolca biodrowego (okolice kieszeni spodni).",
          "sets_reps": "Ok. 1 minuta na każdą stronę."
        },
        {
          "name": "[Rozciąganie] Przód uda (leżąc na boku / stojąc)",
          "description": "Przyciągnij piętę do pośladka. Napnij pośladek i utrzymuj lekkie tylopochylenie miednicy.",
          "sets_reps": "1-3 serie x 10 powtórzeń na stronę, z pauzą 3 sekundy w rozciągnięciu."
        },
        {
          "name": "[Rozciąganie] Przywodziciele (jednostronnie w klęku / szeroki rozkrok)",
          "description": "W klęku podpartym wystaw jedną nogę do boku lub w szerokim rozkroku stojąc, przenieś ciężar ciała na jedną stronę.",
          "sets_reps": "1-3 serie x 10 powtórzeń na stronę (lub na każdą stronę w rozkroku), z pauzą 3 sekundy."
        },
        {
          "name": "[Rozciąganie] 90/90 (rotacja bioder)",
          "description": "Siedząc, nogi w pozycji 90/90. Pochyl klatkę piersiową do podudzia nogi przedniej. Wykonuj naprzemiennie.",
          "sets_reps": "1-3 serie x 10 powtórzeń naprzemiennie (pauza 3 sek w pochyleniu) + dodatkowo zatrzymanie na LEWEJ stronie na 20 sekund."
        },
        {
          "name": "[Rozciąganie/Mobilność] Kot-Krowa (Cat-Cow)",
          "description": "W klęku podpartym, naprzemiennie zaokrąglaj i wykonuj wklęsły łuk pleców.",
          "sets_reps": "1-3 serie x 10 powtórzeń."
        },
        {
          "name": "[Rozciąganie/Mobilność] Rotacje tułowia tyłem do ściany",
          "description": "Stań tyłem blisko ściany. Wykonuj rotację tułowia, starając się dotknąć ściany obiema rękami. Rotacja na wdechu.",
          "sets_reps": "1-3 serie x 10 powtórzeń naprzemiennie (pauza min. 3 sekundy w rotacji)."
        },
        {
          "name": "[Aktywacja] Mostowanie bioder (Glute Bridge)",
          "description": "Leżąc na plecach, unoś biodra, napinając pośladki. Opcjonalnie: stopy na podłodze lub podudzia na piłce gimnastycznej.",
          "sets_reps": "1-3 serie x 10+ powtórzeń."
        },
        {
          "name": "[Aktywacja/Stabilizacja] Utrzymanie mostu na barkach z pracą nóg",
          "description": "Utrzymaj pozycję mostu. Opcjonalnie: a) na piłce: naprzemienne uginanie i prostowanie kolan; b) na podłodze: naprzemienne unoszenie nóg.",
          "sets_reps": "1-3 serie x 20-30 sekund pracy ciągłej."
        },
        {
          "name": "[Aktywacja/Core] Martwy robak (Dead Bug)",
          "description": "Leżąc na plecach, naprzemiennie opuszczaj przeciwległą rękę i nogę, utrzymując stabilny tułów i napięty brzuch.",
          "sets_reps": "1-3 serie x 20+ powtórzeń (10+ na stronę)."
        },
        {
          "name": "[Aktywacja/Core] Kołyska gimnastyczna (Hollow Body Hold / Rock)",
          "description": "Leżąc na plecach, unieś głowę, barki i nogi lekko nad podłogę, ramiona wzdłuż ciała lub za głową. Utrzymaj napięcie brzucha. Opcjonalnie: kołysanie.",
          "sets_reps": "1-3 serie x 5+ powtórzeń (kołysanie) lub utrzymanie pozycji (np. 20-30 sek)."
        },
        {
          "name": "[Aktywacja/Wzmacnianie] Wiosłowanie w podporze przodem (Renegade Row)",
          "description": "W pozycji deski na dłoniach, stopy szerzej. Naprzemiennie przyciągaj rękę do klatki piersiowej, minimalizując rotację bioder.",
          "sets_reps": "1-3 serie x 6+ powtórzeń na stronę (do upadku technicznego)."
        }
      ]
    },
    "pain_monitoring": {
      "scale": "Monitoruj odczucia w ciele, zwłaszcza w L stawie skokowym, L udzie (przód/tył), dolnych plecach i brzuchu. Zwracaj uwagę na jakość ruchu, symetrię i ewentualny dyskomfort.",
      "rules": [
        "Odczucia OK: Uczucie pracy mięśniowej, lekkie zmęczenie, rozciąganie bez bólu - kontynuuj.",
        "Asymetria/Dyskomfort: Zauważ różnice między stronami. Jeśli czujesz dyskomfort (nie ból), spróbuj zmniejszyć zakres/obciążenie lub liczbę powtórzeń po słabszej stronie. Skup się na technice.",
        "Ból Ostry/Narastający: STOP! Przerwij ćwiczenie lub aktywność, która wywołuje taki ból. Nie 'przebiegaj' przez ból.",
        "Reakcja po Treningu/Następnego Dnia: Obserwuj reakcję organizmu, zwłaszcza po bieganiu. Czy rutyna pomaga? Czy pojawiają się nowe dolegliwości?",
        "Słuchaj Ciała: Bądź świadomy sygnałów wysyłanych przez ciało. Prewencja wymaga cierpliwości i uwagi na detale."
      ]
    },
    "notes": [
      "KONSEKWENCJA: Regularne wykonywanie rutyny jest kluczowe dla adaptacji i prewencji kontuzji.",
      "TECHNIKA: Skup się na poprawnej technice wykonywania ćwiczeń, szczególnie aktywacyjnych i tych angażujących core oraz stabilizację miednicy.",
      "POPRZEDNIE ĆWICZENIA: Kontynuuj wykonywanie ćwiczeń, które robiłeś wcześniej, jeśli przynosiły korzyści (możesz je zintegrować z powyższą rutyną).",
      "AKTYWNOŚĆ CODZIENNA: Dbaj o minimum 10 000 kroków dziennie lub regularny ruch symetryczny (pływanie, rower stacjonarny).",
      "AKTYWNE PRZERWY: Wprowadź regularne przerwy w pracy siedzącej (wstawanie, chodzenie, proste ćwiczenia mobilizacyjne/aktywacyjne).",
      "SŁUCHAJ CIAŁA: Ten plan to zestaw zaleceń. Obserwuj reakcję swojego organizmu i modyfikuj obciążenie (np. ilość serii/powtórzeń) w razie potrzeby.",
      "KONSULTACJA: W razie wątpliwości, bólu lub braku poprawy, skonsultuj się z fizjoterapeutą prowadzącym lub lekarzem."
    ]
  }
  
  